## Michał Ściubisz
## Analiza i Bazy Danych - Grupa 6 - Piątek 8:00

Link do repozytorium:
https://github.com/michalsciubisz/MichalSciubisz_AiBD

In [2]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

In [3]:
# result_set = db.execute("SELECT * FROM city")
# for r in result_set:
#     print(r)

In [4]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [5]:
df = pd.read_sql('select * from city', con=connection)
print(df)

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

### Zadanie 1

Ile kategorii filmów mamy w wypożyczalni?

In [153]:
categories = pd.read_sql('SELECT COUNT(name) FROM category', con=connection)

print(f'W wypożyczalni jest {categories.loc[0][0]} kategorii filmów.')

W wypożyczalni jest 16 kategorii filmów.

### Zadanie 2

Wyświetl listę kategorii w kolejności alfabetycznej.

In [154]:
categories_alph = pd.read_sql('SELECT name FROM category ORDER BY name ASC', con=connection)

print(categories_alph)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

### Zadanie 3

Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [155]:
oldest_film = pd.read_sql('SELECT title FROM film ORDER BY release_year DESC LIMIT 1', con=connection)

print(f'Najstarszy film: {oldest_film.loc[0][0]}')

newest_film = pd.read_sql('SELECT title FROM film ORDER BY release_year ASC LIMIT 1', con=connection)

print(f'Najmłodszy film: {newest_film.loc[0][0]}')

Najstarszy film: Chamber Italian
Najmłodszy film: Chamber Italian

### Zadanie 4

Ile wypożyczeń odbyło się pomiędzy 2005-07-01 a 2005-08-01?

In [156]:
how_many = pd.read_sql("SELECT COUNT(rental_date) FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'", con=connection)

print(f'W okresie pomiędzy 2005-07-01 a 2005-08-01 było {how_many.loc[0][0]} wypożyczeń.')

W okresie pomiędzy 2005-07-01 a 2005-08-01 było 6709 wypożyczeń.

### Zadanie 5

Ile wypożyczeń odbyło się pomiędzy 2010-01-01 a 2011-02-01?

In [157]:
how_many2 = pd.read_sql("SELECT COUNT(rental_date) FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01'", con=connection)
print(f'W okresie pomiędzy 2010-01-01 a 2011-02-01 było {how_many2.loc[0][0]} wypożyczeń.')

W okresie pomiędzy 2010-01-01 a 2011-02-01 było 0 wypożyczeń.

### Zadanie 6

Znajdź największą płatność wypożyczenia.

In [159]:
highest_payment = pd.read_sql("SELECT amount FROM payment ORDER BY amount DESC LIMIT 1", con=connection)

print('Największa płatnośc wypożyczenia wynosi:', highest_payment['amount'][0])

Największa płatnośc wypożyczenia wynosi: 11.99

### Zadanie 7

Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [161]:
query = '''
SELECT customer.customer_id, customer.first_name, customer.last_name, country.country
FROM customer
INNER JOIN address USING(address_id)
INNER JOIN city USING(city_id)
INNER JOIN country USING(country_id)
WHERE country.country IN ('Nigeria', 'Bangladesh', 'Poland')
'''

citizen = pd.read_sql(query, con=connection)

print(citizen)

    customer_id first_name  last_name     country
0           284      Sonia    Gregory     Nigeria
1           318      Brian      Wyman      Poland
2           572     Sidney   Burleson      Poland
3           409     Rodney    Moeller     Nigeria
4           332    Stephen     Qualls  Bangladesh
5           286      Velma      Lucas     Nigeria
6            80    Marilyn       Ross     Nigeria
7           198      Elsie     Kelley     Nigeria
8           103     Gladys   Hamilton     Nigeria
9           329      Frank   Waggoner  Bangladesh
10          128   Marjorie     Tucker      Poland
11           18      Carol     Garcia     Nigeria
12          270       Leah     Curtis      Poland
13          501      Ruben      Geary      Poland
14          277       Olga    Jimenez     Nigeria
15          156     Bertha   Ferguson     Nigeria
16          280     Tracey    Barrett     Nigeria
17          250         Jo     Fowler     Nigeria
18          571    Johnnie   Chisholm      Poland
19          562    Wallace      Slone     Nigeria
20           21   Michelle      Clark  Bangladesh
21          380    Russell    Brinson      Poland
22          558     Jimmie  Eggleston      Poland
23          232  Constance       Reid     Nigeria

### Zadanie 8

Gdzie mieszkają członkowie personelu?

In [164]:
query8 = '''
SELECT staff.first_name, staff.last_name, address.address, address.district, city.city
FROM staff
INNER JOIN address USING(address_id)
INNER JOIN city USING(city_id)
'''

personel = pd.read_sql(query8, con=connection)

print(personel)

  first_name last_name               address district        city
0       Mike   Hillyer     23 Workhaven Lane  Alberta  Lethbridge
1        Jon  Stephens  1411 Lillydale Drive      QLD   Woodridge

### Zadanie 9

Ilu pracowników mieszka w Argentynie lub Hiszpani?

In [165]:
query9 = '''
SELECT COUNT(*)
FROM staff
INNER JOIN address USING(address_id)
INNER JOIN city USING(city_id)
INNER JOIN country USING(country_id)
WHERE country.country IN ('Spain', 'Argentina')
'''

personel_country = db.execute(query9)

print(f'W Argentynie lub Hiszpani mieszka {tuple(personel_country)[0][0]} pracowników.')

W Argentynie lub Hiszpani mieszka 0 pracowników.

### Zadanie 10

Jakie kategorie filmów zostały wypożyczone przez klientów?

In [166]:
query10 = '''
SELECT DISTINCT category.name
FROM category
INNER JOIN film_category USING(category_id)
INNER JOIN film USING(film_id)
INNER JOIN inventory USING(film_id)
INNER JOIN rental USING(inventory_id)
'''

categories_rent = pd.read_sql(query10, con=connection)

print(categories_rent)

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

### Zadanie 11

Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce. (branę pod uwagę jest USA)

In [174]:
query11 = '''
SELECT DISTINCT category.name
FROM category
INNER JOIN film_category USING(category_id)
INNER JOIN film USING(film_id)
INNER JOIN inventory USING(film_id)
INNER JOIN rental USING(inventory_id)
INNER JOIN customer USING(customer_id)
INNER JOIN address USING(address_id)
INNER JOIN city USING(city_id)
INNER JOIN country USING(country_id)
WHERE country = 'United States'
'''

categories_country = pd.read_sql(query11, con=connection)

print(categories_country)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

### Zadanie 12

Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley.

In [173]:
query12 = '''
SELECT DISTINCT film.title, actor.first_name, actor.last_name
FROM film
INNER JOIN film_actor USING(film_id)
INNER JOIN actor USING(actor_id)
WHERE actor.first_name IN ('Olympia', 'Julia', 'Ellen') AND actor.last_name IN ('Pfeiffer', 'Zellweger', 'Presley')
'''

titles_actor = pd.read_sql(query12, con=connection)

print(titles_actor)

                   title first_name  last_name
0            Badman Dawn    Olympia   Pfeiffer
1        Bilko Anonymous      Ellen    Presley
2   Breakfast Goldfinger      Julia  Zellweger
3      Caribbean Liberty      Ellen    Presley
4       Casper Dragonfly      Ellen    Presley
..                   ...        ...        ...
64             Turn Star      Ellen    Presley
65            Wait Cider    Olympia   Pfeiffer
66          Women Dorado      Ellen    Presley
67             Won Dares      Julia  Zellweger
68         Wyoming Storm      Julia  Zellweger

[69 rows x 3 columns]